# HomeWork_sem2
// 1. Напишите программу, которая принимает на вход трехзначное число
// и на выходе показывает вторую цифру этого числа
// 456->5
// 782->8
// 918->1

// Console.WriteLine("Введите число");
// int num=Convert.ToInt32(Console.ReadLine());

// int num1=num/10;
// int num2=num1%10;
// Console.WriteLine(num2);

// 2. Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет
// 645->5
// 78->нет
// 32679->6

// Console.Write("Введите число");
// string num1Text=Console.ReadLine();

// if(num1Text.Length>2)
// {
//     Console.WriteLine("Третья цифра" + num1Text[2]);
// }
// else
// {
//     Console.WriteLine("Третьей цифры нет");
// }

// 3. Напишите программу которая принимает на вход цифру, обозначающую день недели, и проверяет, 
// является ли этот день выходным.
// 6->да
// 7->да
// 1->нет

// Console.WriteLine("Введите число");
// int num=Convert.ToInt32(Console.ReadLine());

// if(num<6)
// {
//     Console.WriteLine("Будни");
// }
// else if((num>5) || (num<8))
// {
//     Console.WriteLine("Выходной");
// }
// else
// {
//     Console.WriteLine("Такого дня нет");
// }
